In [1]:
import numpy as np
import pandas as pd

In [2]:
d1 = {'Name':['Shivani','Ishani','Siddharth','Neil'],'Math':[77,76,89,87]}
d2 = {'Name':['Vansh','Shivani','Ishani','Siddharth'],'Science':[54,43,67,78]}
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [3]:
df1

        Name  Math
0    Shivani    77
1     Ishani    76
2  Siddharth    89
3       Neil    87

In [4]:
df2

        Name  Science
0      Vansh       54
1    Shivani       43
2     Ishani       67
3  Siddharth       78

### Inner Join

In [6]:
pd.merge(df1,df2,on='Name')

        Name  Math  Science
0    Shivani    77       43
1     Ishani    76       67
2  Siddharth    89       78

In [7]:
pd.merge(df2,df1,on='Name')

        Name  Science  Math
0    Shivani       43    77
1     Ishani       67    76
2  Siddharth       78    89

### Left Join

In [11]:
pd.merge(df1,df2,on='Name',how='left')

        Name  Math  Science
0    Shivani    77     43.0
1     Ishani    76     67.0
2  Siddharth    89     78.0
3       Neil    87      NaN

### Right Join

In [12]:
pd.merge(df1,df2,on='Name',how='right')

        Name  Math  Science
0    Shivani  77.0       43
1     Ishani  76.0       67
2  Siddharth  89.0       78
3      Vansh   NaN       54

### Outer Join

In [13]:
pd.merge(df1,df2,on='Name',how='outer')

        Name  Math  Science
0    Shivani  77.0     43.0
1     Ishani  76.0     67.0
2  Siddharth  89.0     78.0
3       Neil  87.0      NaN
4      Vansh   NaN     54.0

In [14]:
df = pd.merge(df1,df2,on='Name')
df

        Name  Math  Science
0    Shivani    77       43
1     Ishani    76       67
2  Siddharth    89       78

In [15]:
# Adding a calculated column to the dataframe
df['Total'] = df['Math'] + df['Science']
df

        Name  Math  Science  Total
0    Shivani    77       43    120
1     Ishani    76       67    143
2  Siddharth    89       78    167

In [19]:
# Renaming the existing column ,this is temporary solution it wont affect the original df
df.rename(columns={'Total':'Total_outof_200'})

        Name  Math  Science  Total_outof_200
0    Shivani    77       43              120
1     Ishani    76       67              143
2  Siddharth    89       78              167

In [20]:
df

        Name  Math  Science  Total
0    Shivani    77       43    120
1     Ishani    76       67    143
2  Siddharth    89       78    167

In [21]:
# TO modify the df use inplace=True parameter,by default value is inplace is False
df.rename(columns={'Total':'Total_outof_200'},inplace=True)

In [22]:
df

        Name  Math  Science  Total_outof_200
0    Shivani    77       43              120
1     Ishani    76       67              143
2  Siddharth    89       78              167

# Concate

In [24]:
df_a = pd.DataFrame(np.arange(10).reshape(5,2),columns=['A','B'])
df_b = pd.DataFrame(np.arange(10,20).reshape(5,2),columns=['X','Y'])

In [25]:
df_a

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [26]:
df_b

    X   Y
0  10  11
1  12  13
2  14  15
3  16  17
4  18  19

### Concatenating along the columns

In [27]:
pd.concat([df_a,df_b],axis=1)

   A  B   X   Y
0  0  1  10  11
1  2  3  12  13
2  4  5  14  15
3  6  7  16  17
4  8  9  18  19

In [34]:
pd.concat([df_a,df_b],axis=0,sort=False,)

     A    B     X     Y
0  0.0  1.0   NaN   NaN
1  2.0  3.0   NaN   NaN
2  4.0  5.0   NaN   NaN
3  6.0  7.0   NaN   NaN
4  8.0  9.0   NaN   NaN
0  NaN  NaN  10.0  11.0
1  NaN  NaN  12.0  13.0
2  NaN  NaN  14.0  15.0
3  NaN  NaN  16.0  17.0
4  NaN  NaN  18.0  19.0

# Append

In [35]:
df1

        Name  Math
0    Shivani    77
1     Ishani    76
2  Siddharth    89
3       Neil    87

In [36]:
df3 = pd.DataFrame({'Name':['Rahul','Pranali'],'Math':[76,86]})
df3

      Name  Math
0    Rahul    76
1  Pranali    86

In [37]:
df1.append(df3)

        Name  Math
0    Shivani    77
1     Ishani    76
2  Siddharth    89
3       Neil    87
0      Rahul    76
1    Pranali    86

In [38]:
### To get proper index we use ignore_index=True
df1.append(df3,ignore_index=True)

        Name  Math
0    Shivani    77
1     Ishani    76
2  Siddharth    89
3       Neil    87
4      Rahul    76
5    Pranali    86